/*************************************************
Copyright (C), 2009-2012    , Leetro Automation Co., Ltd.
文件名:	05_21_POD之平凡布局类型.cpp
作  者:	钱锐      版本: V1.0.0     新建日期: 2024.03.21
描  述: POD之平凡布局类型的要求
备  注:	POD平凡布局类型：
        ​	1、具有默认构造、默认析构、拷贝构造、拷贝赋值运算符、移动构造、移动构造运算符函数，且不能重写这些函数;
        ​	2、没有虚函数和虚基类;

修改记录:

  1.  日期: 2024.03.21
      作者: 钱锐
      内容:
          1) 此为模板第一个版本；
      版本:V1.0.0

*************************************************/
#include <iostream>

int main()
{
    return EXIT_SUCCESS;
}
