"""
Copyright (C), 2009-2012    , Level Chip Co., Ltd.
文件名:	06_14_字典的定义.py
作  者:	钱锐      版本: V0.1.0     新建日期: 2025.06.22
描  述: 字典的定义
备  注:
修改记录:

  1.  日期: 2025.06.22
      作者: 钱锐
      内容:
          1) 此为模板第一个版本；
      版本:V0.1.0
"""

#定义字典
my_dict1 = {"王力宏": 99, "周杰伦": 88, "林俊杰": 77}

#定义空字典
my_dict2 = {}
my_dict3 = dict()

print(f"字典1的内容是：{my_dict1}，类型：{type(my_dict1)}")
print(f"字典2的内容是：{my_dict2}，类型：{type(my_dict2)}")
print(f"字典3的内容是：{my_dict3}，类型：{type(my_dict3)}")

#定义重复key的字典
my_dict1 = {"王力宏": 99, "周杰伦": 88, "林俊杰": 77, "周杰伦": 88}
print(f"重复key字典的内容是：{my_dict1}")

#从字典中基于key获取value
print(f"王力宏的分数是：{my_dict1["王力宏"]}")
print(f"林俊杰的分数是：{my_dict1["林俊杰"]}")

#定义嵌套字典
stu_grades = {
    "王力宏": {
        "语文": 77,
        "数学": 66,
        "英语": 33
    },
    "周杰伦": {
        "语文": 88,
        "数学": 86,
        "英语": 55
    },
    "林俊杰": {
        "语文": 99,
        "数学": 96,
        "英语": 66
    }
}

print(f"学生的考试信息是：{stu_grades}")
print(f"林俊杰的数学分数是：{stu_grades["林俊杰"]["数学"]}")
