"""
Copyright (C), 2009-2012    , Level Chip Co., Ltd.
文件名:	06_16_字典课后练习讲解.py
作  者:	钱锐      版本: V0.1.0     新建日期: 2025.06.22
描  述: 字典课后练习讲解
备  注:
修改记录:

  1.  日期: 2025.06.22
      作者: 钱锐
      内容:
          1) 此为模板第一个版本；
      版本:V0.1.0
"""

company_info = {
    "王力宏": {
        "部门": "科技部",
        "工资": 3000,
        "级别": 1
    },
    "周杰伦": {
        "部门": "市场部",
        "工资": 5000,
        "级别": 2
    },
    "林俊杰": {
        "部门": "市场部",
        "工资": 7000,
        "级别": 3
    },
    "张学友": {
        "部门": "科技部",
        "工资": 4000,
        "级别": 1
    },
    "刘德华": {
        "部门": "市场部",
        "工资": 6000,
        "级别": 2
    }
}

print(f"全体员工当前信息如下：\n{company_info}")

for name in company_info:
    if company_info[name]["级别"] == 1:
        company_info[name]["级别"] += 1
        company_info[name]["工资"] += 1000

print(f"全体员工级别为1的员工完成升职加薪的操作后：\n{company_info}")